grevaillot/svd_tools/headers/STM32H7x7_CM7/ethernet_mac.h
/** @defgroup ethernet_mac_maccr MACCR Operating mode configuration register
@{*/

/** Ethernet_MAC_MACCR_ARPEN ARPEN **/
#define Ethernet_MAC_MACCR_ARPEN		(1 << 31)

#define Ethernet_MAC_MACCR_SARC_SHIFT		28
#define Ethernet_MAC_MACCR_SARC_MASK		0x07
/** @defgroup ethernet_mac_maccr_sarc SARC SARC
@{*/
/**@}*/

/** Ethernet_MAC_MACCR_IPC IPC **/
#define Ethernet_MAC_MACCR_IPC		(1 << 27)

#define Ethernet_MAC_MACCR_IPG_SHIFT		24
#define Ethernet_MAC_MACCR_IPG_MASK		0x07
/** @defgroup ethernet_mac_maccr_ipg IPG IPG
@{*/
/**@}*/

/** Ethernet_MAC_MACCR_GPSLCE GPSLCE **/
#define Ethernet_MAC_MACCR_GPSLCE		(1 << 23)
/** Ethernet_MAC_MACCR_S2KP S2KP **/
#define Ethernet_MAC_MACCR_S2KP		(1 << 22)
/** Ethernet_MAC_MACCR_CST CST **/
#define Ethernet_MAC_MACCR_CST		(1 << 21)
/** Ethernet_MAC_MACCR_ACS ACS **/
#define Ethernet_MAC_MACCR_ACS		(1 << 20)
/** Ethernet_MAC_MACCR_WD WD **/
#define Ethernet_MAC_MACCR_WD		(1 << 19)
/** Ethernet_MAC_MACCR_JD JD **/
#define Ethernet_MAC_MACCR_JD		(1 << 17)
/** Ethernet_MAC_MACCR_JE JE **/
#define Ethernet_MAC_MACCR_JE		(1 << 16)
/** Ethernet_MAC_MACCR_FES FES **/
#define Ethernet_MAC_MACCR_FES		(1 << 14)
/** Ethernet_MAC_MACCR_DM DM **/
#define Ethernet_MAC_MACCR_DM		(1 << 13)
/** Ethernet_MAC_MACCR_LM LM **/
#define Ethernet_MAC_MACCR_LM		(1 << 12)
/** Ethernet_MAC_MACCR_ECRSFD ECRSFD **/
#define Ethernet_MAC_MACCR_ECRSFD		(1 << 11)
/** Ethernet_MAC_MACCR_DO DO **/
#define Ethernet_MAC_MACCR_DO		(1 << 10)
/** Ethernet_MAC_MACCR_DCRS DCRS **/
#define Ethernet_MAC_MACCR_DCRS		(1 << 9)
/** Ethernet_MAC_MACCR_DR DR **/
#define Ethernet_MAC_MACCR_DR		(1 << 8)

#define Ethernet_MAC_MACCR_BL_SHIFT		5
#define Ethernet_MAC_MACCR_BL_MASK		0x03
/** @defgroup ethernet_mac_maccr_bl BL BL
@{*/
/**@}*/

/** Ethernet_MAC_MACCR_DC DC **/
#define Ethernet_MAC_MACCR_DC		(1 << 4)

#define Ethernet_MAC_MACCR_PRELEN_SHIFT		2
#define Ethernet_MAC_MACCR_PRELEN_MASK		0x03
/** @defgroup ethernet_mac_maccr_prelen PRELEN PRELEN
@{*/
/**@}*/

/** Ethernet_MAC_MACCR_TE TE **/
#define Ethernet_MAC_MACCR_TE		(1 << 1)
/** Ethernet_MAC_MACCR_RE Receiver Enable **/
#define Ethernet_MAC_MACCR_RE		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macecr MACECR Extended operating mode configuration register
@{*/


#define Ethernet_MAC_MACECR_EIPG_SHIFT		25
#define Ethernet_MAC_MACECR_EIPG_MASK		0x1f
/** @defgroup ethernet_mac_macecr_eipg EIPG EIPG
@{*/
/**@}*/

/** Ethernet_MAC_MACECR_EIPGEN EIPGEN **/
#define Ethernet_MAC_MACECR_EIPGEN		(1 << 24)
/** Ethernet_MAC_MACECR_USP USP **/
#define Ethernet_MAC_MACECR_USP		(1 << 18)
/** Ethernet_MAC_MACECR_SPEN SPEN **/
#define Ethernet_MAC_MACECR_SPEN		(1 << 17)
/** Ethernet_MAC_MACECR_DCRCC DCRCC **/
#define Ethernet_MAC_MACECR_DCRCC		(1 << 16)

#define Ethernet_MAC_MACECR_GPSL_SHIFT		0
#define Ethernet_MAC_MACECR_GPSL_MASK		0x3fff
/** @defgroup ethernet_mac_macecr_gpsl GPSL GPSL
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macpfr MACPFR Packet filtering control register
@{*/

/** Ethernet_MAC_MACPFR_RA RA **/
#define Ethernet_MAC_MACPFR_RA		(1 << 31)
/** Ethernet_MAC_MACPFR_DNTU DNTU **/
#define Ethernet_MAC_MACPFR_DNTU		(1 << 21)
/** Ethernet_MAC_MACPFR_IPFE IPFE **/
#define Ethernet_MAC_MACPFR_IPFE		(1 << 20)
/** Ethernet_MAC_MACPFR_VTFE VTFE **/
#define Ethernet_MAC_MACPFR_VTFE		(1 << 16)
/** Ethernet_MAC_MACPFR_HPF HPF **/
#define Ethernet_MAC_MACPFR_HPF		(1 << 10)
/** Ethernet_MAC_MACPFR_SAF SAF **/
#define Ethernet_MAC_MACPFR_SAF		(1 << 9)
/** Ethernet_MAC_MACPFR_SAIF SAIF **/
#define Ethernet_MAC_MACPFR_SAIF		(1 << 8)

#define Ethernet_MAC_MACPFR_PCF_SHIFT		6
#define Ethernet_MAC_MACPFR_PCF_MASK		0x03
/** @defgroup ethernet_mac_macpfr_pcf PCF PCF
@{*/
/**@}*/

/** Ethernet_MAC_MACPFR_DBF DBF **/
#define Ethernet_MAC_MACPFR_DBF		(1 << 5)
/** Ethernet_MAC_MACPFR_PM PM **/
#define Ethernet_MAC_MACPFR_PM		(1 << 4)
/** Ethernet_MAC_MACPFR_DAIF DAIF **/
#define Ethernet_MAC_MACPFR_DAIF		(1 << 3)
/** Ethernet_MAC_MACPFR_HMC HMC **/
#define Ethernet_MAC_MACPFR_HMC		(1 << 2)
/** Ethernet_MAC_MACPFR_HUC HUC **/
#define Ethernet_MAC_MACPFR_HUC		(1 << 1)
/** Ethernet_MAC_MACPFR_PR PR **/
#define Ethernet_MAC_MACPFR_PR		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macwtr MACWTR Watchdog timeout register
@{*/

/** Ethernet_MAC_MACWTR_PWE PWE **/
#define Ethernet_MAC_MACWTR_PWE		(1 << 8)

#define Ethernet_MAC_MACWTR_WTO_SHIFT		0
#define Ethernet_MAC_MACWTR_WTO_MASK		0x0f
/** @defgroup ethernet_mac_macwtr_wto WTO WTO
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macht0r MACHT0R Hash Table 0 register
@{*/


#define Ethernet_MAC_MACHT0R_HT31T0_SHIFT		0
#define Ethernet_MAC_MACHT0R_HT31T0_MASK		0xffffffff
/** @defgroup ethernet_mac_macht0r_ht31t0 HT31T0 HT31T0
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macht1r MACHT1R Hash Table 1 register
@{*/


#define Ethernet_MAC_MACHT1R_HT63T32_SHIFT		0
#define Ethernet_MAC_MACHT1R_HT63T32_MASK		0xffffffff
/** @defgroup ethernet_mac_macht1r_ht63t32 HT63T32 HT63T32
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macvtr MACVTR VLAN tag register
@{*/

/** Ethernet_MAC_MACVTR_EIVLRXS EIVLRXS **/
#define Ethernet_MAC_MACVTR_EIVLRXS		(1 << 31)

#define Ethernet_MAC_MACVTR_EIVLS_SHIFT		28
#define Ethernet_MAC_MACVTR_EIVLS_MASK		0x03
/** @defgroup ethernet_mac_macvtr_eivls EIVLS EIVLS
@{*/
/**@}*/

/** Ethernet_MAC_MACVTR_ERIVLT ERIVLT **/
#define Ethernet_MAC_MACVTR_ERIVLT		(1 << 27)
/** Ethernet_MAC_MACVTR_EDVLP EDVLP **/
#define Ethernet_MAC_MACVTR_EDVLP		(1 << 26)
/** Ethernet_MAC_MACVTR_VTHM VTHM **/
#define Ethernet_MAC_MACVTR_VTHM		(1 << 25)
/** Ethernet_MAC_MACVTR_EVLRXS EVLRXS **/
#define Ethernet_MAC_MACVTR_EVLRXS		(1 << 24)

#define Ethernet_MAC_MACVTR_EVLS_SHIFT		21
#define Ethernet_MAC_MACVTR_EVLS_MASK		0x03
/** @defgroup ethernet_mac_macvtr_evls EVLS EVLS
@{*/
/**@}*/

/** Ethernet_MAC_MACVTR_DOVLTC DOVLTC **/
#define Ethernet_MAC_MACVTR_DOVLTC		(1 << 20)
/** Ethernet_MAC_MACVTR_ERSVLM ERSVLM **/
#define Ethernet_MAC_MACVTR_ERSVLM		(1 << 19)
/** Ethernet_MAC_MACVTR_ESVL ESVL **/
#define Ethernet_MAC_MACVTR_ESVL		(1 << 18)
/** Ethernet_MAC_MACVTR_VTIM VTIM **/
#define Ethernet_MAC_MACVTR_VTIM		(1 << 17)
/** Ethernet_MAC_MACVTR_ETV ETV **/
#define Ethernet_MAC_MACVTR_ETV		(1 << 16)

