grevaillot/svd_tools/headers/STM32H7x7_CM7/ethernet_mac.h
#define Ethernet_MAC_MACVTR_VL_SHIFT		0
#define Ethernet_MAC_MACVTR_VL_MASK		0xffff
/** @defgroup ethernet_mac_macvtr_vl VL VL
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macvhtr MACVHTR VLAN Hash table register
@{*/


#define Ethernet_MAC_MACVHTR_VLHT_SHIFT		0
#define Ethernet_MAC_MACVHTR_VLHT_MASK		0xffff
/** @defgroup ethernet_mac_macvhtr_vlht VLHT VLHT
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macvir MACVIR VLAN inclusion register
@{*/

/** Ethernet_MAC_MACVIR_VLTI VLTI **/
#define Ethernet_MAC_MACVIR_VLTI		(1 << 20)
/** Ethernet_MAC_MACVIR_CSVL CSVL **/
#define Ethernet_MAC_MACVIR_CSVL		(1 << 19)
/** Ethernet_MAC_MACVIR_VLP VLP **/
#define Ethernet_MAC_MACVIR_VLP		(1 << 18)

#define Ethernet_MAC_MACVIR_VLC_SHIFT		16
#define Ethernet_MAC_MACVIR_VLC_MASK		0x03
/** @defgroup ethernet_mac_macvir_vlc VLC VLC
@{*/
/**@}*/


#define Ethernet_MAC_MACVIR_VLT_SHIFT		0
#define Ethernet_MAC_MACVIR_VLT_MASK		0xffff
/** @defgroup ethernet_mac_macvir_vlt VLT VLT
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macivir MACIVIR Inner VLAN inclusion register
@{*/

/** Ethernet_MAC_MACIVIR_VLTI VLTI **/
#define Ethernet_MAC_MACIVIR_VLTI		(1 << 20)
/** Ethernet_MAC_MACIVIR_CSVL CSVL **/
#define Ethernet_MAC_MACIVIR_CSVL		(1 << 19)
/** Ethernet_MAC_MACIVIR_VLP VLP **/
#define Ethernet_MAC_MACIVIR_VLP		(1 << 18)

#define Ethernet_MAC_MACIVIR_VLC_SHIFT		16
#define Ethernet_MAC_MACIVIR_VLC_MASK		0x03
/** @defgroup ethernet_mac_macivir_vlc VLC VLC
@{*/
/**@}*/


#define Ethernet_MAC_MACIVIR_VLT_SHIFT		0
#define Ethernet_MAC_MACIVIR_VLT_MASK		0xffff
/** @defgroup ethernet_mac_macivir_vlt VLT VLT
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macqtxfcr MACQTxFCR Tx Queue flow control register
@{*/


#define Ethernet_MAC_MACQTxFCR_PT_SHIFT		16
#define Ethernet_MAC_MACQTxFCR_PT_MASK		0xffff
/** @defgroup ethernet_mac_macqtxfcr_pt PT PT
@{*/
/**@}*/

/** Ethernet_MAC_MACQTxFCR_DZPQ DZPQ **/
#define Ethernet_MAC_MACQTxFCR_DZPQ		(1 << 7)

#define Ethernet_MAC_MACQTxFCR_PLT_SHIFT		4
#define Ethernet_MAC_MACQTxFCR_PLT_MASK		0x07
/** @defgroup ethernet_mac_macqtxfcr_plt PLT PLT
@{*/
/**@}*/

/** Ethernet_MAC_MACQTxFCR_TFE TFE **/
#define Ethernet_MAC_MACQTxFCR_TFE		(1 << 1)
/** Ethernet_MAC_MACQTxFCR_FCB_BPA FCB_BPA **/
#define Ethernet_MAC_MACQTxFCR_FCB_BPA		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macrxfcr MACRxFCR Rx flow control register
@{*/

/** Ethernet_MAC_MACRxFCR_UP UP **/
#define Ethernet_MAC_MACRxFCR_UP		(1 << 1)
/** Ethernet_MAC_MACRxFCR_RFE RFE **/
#define Ethernet_MAC_MACRxFCR_RFE		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macisr MACISR Interrupt status register
@{*/

/** Ethernet_MAC_MACISR_RXSTSIS RXSTSIS **/
#define Ethernet_MAC_MACISR_RXSTSIS		(1 << 14)
/** Ethernet_MAC_MACISR_TXSTSIS TXSTSIS **/
#define Ethernet_MAC_MACISR_TXSTSIS		(1 << 13)
/** Ethernet_MAC_MACISR_TSIS TSIS **/
#define Ethernet_MAC_MACISR_TSIS		(1 << 12)
/** Ethernet_MAC_MACISR_MMCTXIS MMCTXIS **/
#define Ethernet_MAC_MACISR_MMCTXIS		(1 << 10)
/** Ethernet_MAC_MACISR_MMCRXIS MMCRXIS **/
#define Ethernet_MAC_MACISR_MMCRXIS		(1 << 9)
/** Ethernet_MAC_MACISR_MMCIS MMCIS **/
#define Ethernet_MAC_MACISR_MMCIS		(1 << 8)
/** Ethernet_MAC_MACISR_LPIIS LPIIS **/
#define Ethernet_MAC_MACISR_LPIIS		(1 << 5)
/** Ethernet_MAC_MACISR_PMTIS PMTIS **/
#define Ethernet_MAC_MACISR_PMTIS		(1 << 4)
/** Ethernet_MAC_MACISR_PHYIS PHYIS **/
#define Ethernet_MAC_MACISR_PHYIS		(1 << 3)

/**@}*/

/** @defgroup ethernet_mac_macier MACIER Interrupt enable register
@{*/

/** Ethernet_MAC_MACIER_RXSTSIE RXSTSIE **/
#define Ethernet_MAC_MACIER_RXSTSIE		(1 << 14)
/** Ethernet_MAC_MACIER_TXSTSIE TXSTSIE **/
#define Ethernet_MAC_MACIER_TXSTSIE		(1 << 13)
/** Ethernet_MAC_MACIER_TSIE TSIE **/
#define Ethernet_MAC_MACIER_TSIE		(1 << 12)
/** Ethernet_MAC_MACIER_LPIIE LPIIE **/
#define Ethernet_MAC_MACIER_LPIIE		(1 << 5)
/** Ethernet_MAC_MACIER_PMTIE PMTIE **/
#define Ethernet_MAC_MACIER_PMTIE		(1 << 4)
/** Ethernet_MAC_MACIER_PHYIE PHYIE **/
#define Ethernet_MAC_MACIER_PHYIE		(1 << 3)

/**@}*/

/** @defgroup ethernet_mac_macrxtxsr MACRxTxSR Rx Tx status register
@{*/

/** Ethernet_MAC_MACRxTxSR_RWT RWT **/
#define Ethernet_MAC_MACRxTxSR_RWT		(1 << 8)
/** Ethernet_MAC_MACRxTxSR_EXCOL LCOL **/
#define Ethernet_MAC_MACRxTxSR_EXCOL		(1 << 5)
/** Ethernet_MAC_MACRxTxSR_LCOL LCOL **/
#define Ethernet_MAC_MACRxTxSR_LCOL		(1 << 4)
/** Ethernet_MAC_MACRxTxSR_EXDEF EXDEF **/
#define Ethernet_MAC_MACRxTxSR_EXDEF		(1 << 3)
/** Ethernet_MAC_MACRxTxSR_LCARR LCARR **/
#define Ethernet_MAC_MACRxTxSR_LCARR		(1 << 2)
/** Ethernet_MAC_MACRxTxSR_NCARR NCARR **/
#define Ethernet_MAC_MACRxTxSR_NCARR		(1 << 1)
/** Ethernet_MAC_MACRxTxSR_TJT TJT **/
#define Ethernet_MAC_MACRxTxSR_TJT		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macpcsr MACPCSR PMT control status register
@{*/

/** Ethernet_MAC_MACPCSR_RWKFILTRST RWKFILTRST **/
#define Ethernet_MAC_MACPCSR_RWKFILTRST		(1 << 31)

#define Ethernet_MAC_MACPCSR_RWKPTR_SHIFT		24
#define Ethernet_MAC_MACPCSR_RWKPTR_MASK		0x1f
/** @defgroup ethernet_mac_macpcsr_rwkptr RWKPTR RWKPTR
@{*/
/**@}*/

/** Ethernet_MAC_MACPCSR_RWKPFE RWKPFE **/
#define Ethernet_MAC_MACPCSR_RWKPFE		(1 << 10)
/** Ethernet_MAC_MACPCSR_GLBLUCAST GLBLUCAST **/
#define Ethernet_MAC_MACPCSR_GLBLUCAST		(1 << 9)
/** Ethernet_MAC_MACPCSR_RWKPRCVD RWKPRCVD **/
#define Ethernet_MAC_MACPCSR_RWKPRCVD		(1 << 6)
/** Ethernet_MAC_MACPCSR_MGKPRCVD MGKPRCVD **/
#define Ethernet_MAC_MACPCSR_MGKPRCVD		(1 << 5)
/** Ethernet_MAC_MACPCSR_RWKPKTEN RWKPKTEN **/
#define Ethernet_MAC_MACPCSR_RWKPKTEN		(1 << 2)
/** Ethernet_MAC_MACPCSR_MGKPKTEN MGKPKTEN **/
#define Ethernet_MAC_MACPCSR_MGKPKTEN		(1 << 1)
/** Ethernet_MAC_MACPCSR_PWRDWN PWRDWN **/
#define Ethernet_MAC_MACPCSR_PWRDWN		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macrwkpfr MACRWKPFR Remove wakeup packet filter register
@{*/


#define Ethernet_MAC_MACRWKPFR_WKUPFRMFTR_SHIFT		0
#define Ethernet_MAC_MACRWKPFR_WKUPFRMFTR_MASK		0xffffffff
/** @defgroup ethernet_mac_macrwkpfr_wkupfrmftr WKUPFRMFTR WKUPFRMFTR
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_maclcsr MACLCSR LPI control status register
@{*/

/** Ethernet_MAC_MACLCSR_LPITCSE LPITCSE **/
#define Ethernet_MAC_MACLCSR_LPITCSE		(1 << 21)
/** Ethernet_MAC_MACLCSR_LPITE LPITE **/
#define Ethernet_MAC_MACLCSR_LPITE		(1 << 20)
/** Ethernet_MAC_MACLCSR_LPITXA LPITXA **/
#define Ethernet_MAC_MACLCSR_LPITXA		(1 << 19)
/** Ethernet_MAC_MACLCSR_PLSEN PLSEN **/
#define Ethernet_MAC_MACLCSR_PLSEN		(1 << 18)
/** Ethernet_MAC_MACLCSR_PLS PLS **/
#define Ethernet_MAC_MACLCSR_PLS		(1 << 17)
/** Ethernet_MAC_MACLCSR_LPIEN LPIEN **/
#define Ethernet_MAC_MACLCSR_LPIEN		(1 << 16)
/** Ethernet_MAC_MACLCSR_RLPIST RLPIST **/
#define Ethernet_MAC_MACLCSR_RLPIST		(1 << 9)
/** Ethernet_MAC_MACLCSR_TLPIST TLPIST **/
#define Ethernet_MAC_MACLCSR_TLPIST		(1 << 8)
/** Ethernet_MAC_MACLCSR_RLPIEX RLPIEX **/
#define Ethernet_MAC_MACLCSR_RLPIEX		(1 << 3)
/** Ethernet_MAC_MACLCSR_RLPIEN RLPIEN **/
#define Ethernet_MAC_MACLCSR_RLPIEN		(1 << 2)
/** Ethernet_MAC_MACLCSR_TLPIEX TLPIEX **/
#define Ethernet_MAC_MACLCSR_TLPIEX		(1 << 1)
/** Ethernet_MAC_MACLCSR_TLPIEN TLPIEN **/
#define Ethernet_MAC_MACLCSR_TLPIEN		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macltcr MACLTCR LPI timers control register
@{*/


#define Ethernet_MAC_MACLTCR_LST_SHIFT		16
#define Ethernet_MAC_MACLTCR_LST_MASK		0x3ff
/** @defgroup ethernet_mac_macltcr_lst LST LST
@{*/
/**@}*/


