grevaillot/svd_tools/headers/STM32H7x7_CM7/ethernet_mac.h
/** @defgroup ethernet_mac_maca1hr MACA1HR Address 1 high register
@{*/

/** Ethernet_MAC_MACA1HR_AE AE **/
#define Ethernet_MAC_MACA1HR_AE		(1 << 31)
/** Ethernet_MAC_MACA1HR_SA SA **/
#define Ethernet_MAC_MACA1HR_SA		(1 << 30)

#define Ethernet_MAC_MACA1HR_MBC_SHIFT		24
#define Ethernet_MAC_MACA1HR_MBC_MASK		0x3f
/** @defgroup ethernet_mac_maca1hr_mbc MBC MBC
@{*/
/**@}*/


#define Ethernet_MAC_MACA1HR_ADDRHI_SHIFT		0
#define Ethernet_MAC_MACA1HR_ADDRHI_MASK		0xffff
/** @defgroup ethernet_mac_maca1hr_addrhi ADDRHI ADDRHI
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_maca1lr MACA1LR Address 1 low register
@{*/


#define Ethernet_MAC_MACA1LR_ADDRLO_SHIFT		0
#define Ethernet_MAC_MACA1LR_ADDRLO_MASK		0xffffffff
/** @defgroup ethernet_mac_maca1lr_addrlo ADDRLO ADDRLO
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_maca2hr MACA2HR Address 2 high register
@{*/

/** Ethernet_MAC_MACA2HR_AE AE **/
#define Ethernet_MAC_MACA2HR_AE		(1 << 31)
/** Ethernet_MAC_MACA2HR_SA SA **/
#define Ethernet_MAC_MACA2HR_SA		(1 << 30)

#define Ethernet_MAC_MACA2HR_MBC_SHIFT		24
#define Ethernet_MAC_MACA2HR_MBC_MASK		0x3f
/** @defgroup ethernet_mac_maca2hr_mbc MBC MBC
@{*/
/**@}*/


#define Ethernet_MAC_MACA2HR_ADDRHI_SHIFT		0
#define Ethernet_MAC_MACA2HR_ADDRHI_MASK		0xffff
/** @defgroup ethernet_mac_maca2hr_addrhi ADDRHI ADDRHI
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_maca2lr MACA2LR Address 2 low register
@{*/


#define Ethernet_MAC_MACA2LR_ADDRLO_SHIFT		0
#define Ethernet_MAC_MACA2LR_ADDRLO_MASK		0xffffffff
/** @defgroup ethernet_mac_maca2lr_addrlo ADDRLO ADDRLO
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_maca3hr MACA3HR Address 3 high register
@{*/

/** Ethernet_MAC_MACA3HR_AE AE **/
#define Ethernet_MAC_MACA3HR_AE		(1 << 31)
/** Ethernet_MAC_MACA3HR_SA SA **/
#define Ethernet_MAC_MACA3HR_SA		(1 << 30)

#define Ethernet_MAC_MACA3HR_MBC_SHIFT		24
#define Ethernet_MAC_MACA3HR_MBC_MASK		0x3f
/** @defgroup ethernet_mac_maca3hr_mbc MBC MBC
@{*/
/**@}*/


#define Ethernet_MAC_MACA3HR_ADDRHI_SHIFT		0
#define Ethernet_MAC_MACA3HR_ADDRHI_MASK		0xffff
/** @defgroup ethernet_mac_maca3hr_addrhi ADDRHI ADDRHI
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_maca3lr MACA3LR Address 3 low register
@{*/


#define Ethernet_MAC_MACA3LR_ADDRLO_SHIFT		0
#define Ethernet_MAC_MACA3LR_ADDRLO_MASK		0xffffffff
/** @defgroup ethernet_mac_maca3lr_addrlo ADDRLO ADDRLO
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mmc_control MMCCONTROL MMC control register
@{*/

/** Ethernet_MAC_MMC_CONTROL_UCDBC UCDBC **/
#define Ethernet_MAC_MMC_CONTROL_UCDBC		(1 << 8)
/** Ethernet_MAC_MMC_CONTROL_CNTPRSTLVL CNTPRSTLVL **/
#define Ethernet_MAC_MMC_CONTROL_CNTPRSTLVL		(1 << 5)
/** Ethernet_MAC_MMC_CONTROL_CNTPRST CNTPRST **/
#define Ethernet_MAC_MMC_CONTROL_CNTPRST		(1 << 4)
/** Ethernet_MAC_MMC_CONTROL_CNTFREEZ CNTFREEZ **/
#define Ethernet_MAC_MMC_CONTROL_CNTFREEZ		(1 << 3)
/** Ethernet_MAC_MMC_CONTROL_RSTONRD RSTONRD **/
#define Ethernet_MAC_MMC_CONTROL_RSTONRD		(1 << 2)
/** Ethernet_MAC_MMC_CONTROL_CNTSTOPRO CNTSTOPRO **/
#define Ethernet_MAC_MMC_CONTROL_CNTSTOPRO		(1 << 1)
/** Ethernet_MAC_MMC_CONTROL_CNTRST CNTRST **/
#define Ethernet_MAC_MMC_CONTROL_CNTRST		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_mmc_rx_interrupt MMCRXINTERRUPT MMC Rx interrupt register
@{*/

/** Ethernet_MAC_MMC_RX_INTERRUPT_RXLPITRCIS RXLPITRCIS **/
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXLPITRCIS		(1 << 27)
/** Ethernet_MAC_MMC_RX_INTERRUPT_RXLPIUSCIS RXLPIUSCIS **/
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXLPIUSCIS		(1 << 26)
/** Ethernet_MAC_MMC_RX_INTERRUPT_RXUCGPIS RXUCGPIS **/
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXUCGPIS		(1 << 17)
/** Ethernet_MAC_MMC_RX_INTERRUPT_RXALGNERPIS RXALGNERPIS **/
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXALGNERPIS		(1 << 6)
/** Ethernet_MAC_MMC_RX_INTERRUPT_RXCRCERPIS RXCRCERPIS **/
#define Ethernet_MAC_MMC_RX_INTERRUPT_RXCRCERPIS		(1 << 5)

/**@}*/

/** @defgroup ethernet_mac_mmc_tx_interrupt MMCTXINTERRUPT MMC Tx interrupt register
@{*/

/** Ethernet_MAC_MMC_TX_INTERRUPT_TXLPITRCIS TXLPITRCIS **/
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXLPITRCIS		(1 << 27)
/** Ethernet_MAC_MMC_TX_INTERRUPT_TXLPIUSCIS TXLPIUSCIS **/
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXLPIUSCIS		(1 << 26)
/** Ethernet_MAC_MMC_TX_INTERRUPT_TXGPKTIS TXGPKTIS **/
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXGPKTIS		(1 << 21)
/** Ethernet_MAC_MMC_TX_INTERRUPT_TXMCOLGPIS TXMCOLGPIS **/
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXMCOLGPIS		(1 << 15)
/** Ethernet_MAC_MMC_TX_INTERRUPT_TXSCOLGPIS TXSCOLGPIS **/
#define Ethernet_MAC_MMC_TX_INTERRUPT_TXSCOLGPIS		(1 << 14)

/**@}*/

/** @defgroup ethernet_mac_mmc_rx_interrupt_mask MMCRXINTERRUPTMASK MMC Rx interrupt mask register
@{*/

/** Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXLPITRCIM RXLPITRCIM **/
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXLPITRCIM		(1 << 27)
/** Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM RXLPIUSCIM **/
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXLPIUSCIM		(1 << 26)
/** Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXUCGPIM RXUCGPIM **/
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXUCGPIM		(1 << 17)
/** Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM RXALGNERPIM **/
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM		(1 << 6)
/** Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM RXCRCERPIM **/
#define Ethernet_MAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM		(1 << 5)

/**@}*/

/** @defgroup ethernet_mac_mmc_tx_interrupt_mask MMCTXINTERRUPTMASK MMC Tx interrupt mask register
@{*/

/** Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXLPITRCIM TXLPITRCIM **/
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXLPITRCIM		(1 << 27)
/** Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM TXLPIUSCIM **/
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXLPIUSCIM		(1 << 26)
/** Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM TXGPKTIM **/
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM		(1 << 21)
/** Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM TXMCOLGPIM **/
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM		(1 << 15)
/** Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM TXSCOLGPIM **/
#define Ethernet_MAC_MMC_TX_INTERRUPT_MASK_TXSCOLGPIM		(1 << 14)

/**@}*/

/** @defgroup ethernet_mac_tx_single_collision_good_packets TXSINGLECOLLISIONGOODPACKETS Tx single collision good packets register
@{*/


#define Ethernet_MAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_SHIFT		0
#define Ethernet_MAC_TX_SINGLE_COLLISION_GOOD_PACKETS_TXSNGLCOLG_MASK		0xffffffff
/** @defgroup ethernet_mac_tx_single_collision_good_packets_txsnglcolg TXSNGLCOLG TXSNGLCOLG
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_tx_multiple_collision_good_packets TXMULTIPLECOLLISIONGOODPACKETS Tx multiple collision good packets register
@{*/


#define Ethernet_MAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_SHIFT		0
#define Ethernet_MAC_TX_MULTIPLE_COLLISION_GOOD_PACKETS_TXMULTCOLG_MASK		0xffffffff
/** @defgroup ethernet_mac_tx_multiple_collision_good_packets_txmultcolg TXMULTCOLG TXMULTCOLG
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_tx_packet_count_good TXPACKETCOUNTGOOD Tx packet count good register
@{*/


#define Ethernet_MAC_TX_PACKET_COUNT_GOOD_TXPKTG_SHIFT		0
#define Ethernet_MAC_TX_PACKET_COUNT_GOOD_TXPKTG_MASK		0xffffffff
/** @defgroup ethernet_mac_tx_packet_count_good_txpktg TXPKTG TXPKTG
@{*/
/**@}*/


/**@}*/

