grevaillot/svd_tools/headers/STM32H7x7_CM7/ethernet_mac.h
/** @defgroup ethernet_mac_rx_crc_error_packets RXCRCERRORPACKETS Rx CRC error packets register
@{*/


#define Ethernet_MAC_RX_CRC_ERROR_PACKETS_RXCRCERR_SHIFT		0
#define Ethernet_MAC_RX_CRC_ERROR_PACKETS_RXCRCERR_MASK		0xffffffff
/** @defgroup ethernet_mac_rx_crc_error_packets_rxcrcerr RXCRCERR RXCRCERR
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_rx_alignment_error_packets RXALIGNMENTERRORPACKETS Rx alignment error packets register
@{*/


#define Ethernet_MAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_SHIFT		0
#define Ethernet_MAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_MASK		0xffffffff
/** @defgroup ethernet_mac_rx_alignment_error_packets_rxalgnerr RXALGNERR RXALGNERR
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_rx_unicast_packets_good RXUNICASTPACKETSGOOD Rx unicast packets good register
@{*/


#define Ethernet_MAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG_SHIFT		0
#define Ethernet_MAC_RX_UNICAST_PACKETS_GOOD_RXUCASTG_MASK		0xffffffff
/** @defgroup ethernet_mac_rx_unicast_packets_good_rxucastg RXUCASTG RXUCASTG
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_tx_lpi_usec_cntr TXLPIUSECCNTR Tx LPI microsecond timer register
@{*/


#define Ethernet_MAC_TX_LPI_USEC_CNTR_TXLPIUSC_SHIFT		0
#define Ethernet_MAC_TX_LPI_USEC_CNTR_TXLPIUSC_MASK		0xffffffff
/** @defgroup ethernet_mac_tx_lpi_usec_cntr_txlpiusc TXLPIUSC TXLPIUSC
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_tx_lpi_tran_cntr TXLPITRANCNTR Tx LPI transition counter register
@{*/


#define Ethernet_MAC_TX_LPI_TRAN_CNTR_TXLPITRC_SHIFT		0
#define Ethernet_MAC_TX_LPI_TRAN_CNTR_TXLPITRC_MASK		0xffffffff
/** @defgroup ethernet_mac_tx_lpi_tran_cntr_txlpitrc TXLPITRC TXLPITRC
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_rx_lpi_usec_cntr RXLPIUSECCNTR Rx LPI microsecond counter register
@{*/


#define Ethernet_MAC_RX_LPI_USEC_CNTR_RXLPIUSC_SHIFT		0
#define Ethernet_MAC_RX_LPI_USEC_CNTR_RXLPIUSC_MASK		0xffffffff
/** @defgroup ethernet_mac_rx_lpi_usec_cntr_rxlpiusc RXLPIUSC RXLPIUSC
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_rx_lpi_tran_cntr RXLPITRANCNTR Rx LPI transition counter register
@{*/


#define Ethernet_MAC_RX_LPI_TRAN_CNTR_RXLPITRC_SHIFT		0
#define Ethernet_MAC_RX_LPI_TRAN_CNTR_RXLPITRC_MASK		0xffffffff
/** @defgroup ethernet_mac_rx_lpi_tran_cntr_rxlpitrc RXLPITRC RXLPITRC
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macl3l4c0r MACL3L4C0R L3 and L4 control 0 register
@{*/

/** Ethernet_MAC_MACL3L4C0R_L4DPIM0 L4DPIM0 **/
#define Ethernet_MAC_MACL3L4C0R_L4DPIM0		(1 << 21)
/** Ethernet_MAC_MACL3L4C0R_L4DPM0 L4DPM0 **/
#define Ethernet_MAC_MACL3L4C0R_L4DPM0		(1 << 20)
/** Ethernet_MAC_MACL3L4C0R_L4SPIM0 L4SPIM0 **/
#define Ethernet_MAC_MACL3L4C0R_L4SPIM0		(1 << 19)
/** Ethernet_MAC_MACL3L4C0R_L4SPM0 L4SPM0 **/
#define Ethernet_MAC_MACL3L4C0R_L4SPM0		(1 << 18)
/** Ethernet_MAC_MACL3L4C0R_L4PEN0 L4PEN0 **/
#define Ethernet_MAC_MACL3L4C0R_L4PEN0		(1 << 16)

#define Ethernet_MAC_MACL3L4C0R_L3HDBM0_SHIFT		11
#define Ethernet_MAC_MACL3L4C0R_L3HDBM0_MASK		0x1f
/** @defgroup ethernet_mac_macl3l4c0r_l3hdbm0 L3HDBM0 L3HDBM0
@{*/
/**@}*/


#define Ethernet_MAC_MACL3L4C0R_L3HSBM0_SHIFT		6
#define Ethernet_MAC_MACL3L4C0R_L3HSBM0_MASK		0x1f
/** @defgroup ethernet_mac_macl3l4c0r_l3hsbm0 L3HSBM0 L3HSBM0
@{*/
/**@}*/

/** Ethernet_MAC_MACL3L4C0R_L3DAIM0 L3DAIM0 **/
#define Ethernet_MAC_MACL3L4C0R_L3DAIM0		(1 << 5)
/** Ethernet_MAC_MACL3L4C0R_L3DAM0 L3DAM0 **/
#define Ethernet_MAC_MACL3L4C0R_L3DAM0		(1 << 4)
/** Ethernet_MAC_MACL3L4C0R_L3SAIM0 L3SAIM0 **/
#define Ethernet_MAC_MACL3L4C0R_L3SAIM0		(1 << 3)
/** Ethernet_MAC_MACL3L4C0R_L3SAM0 L3SAM0 **/
#define Ethernet_MAC_MACL3L4C0R_L3SAM0		(1 << 2)
/** Ethernet_MAC_MACL3L4C0R_L3PEN0 L3PEN0 **/
#define Ethernet_MAC_MACL3L4C0R_L3PEN0		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_macl4a0r MACL4A0R Layer4 address filter 0 register
@{*/


#define Ethernet_MAC_MACL4A0R_L4DP0_SHIFT		16
#define Ethernet_MAC_MACL4A0R_L4DP0_MASK		0xffff
/** @defgroup ethernet_mac_macl4a0r_l4dp0 L4DP0 L4DP0
@{*/
/**@}*/


#define Ethernet_MAC_MACL4A0R_L4SP0_SHIFT		0
#define Ethernet_MAC_MACL4A0R_L4SP0_MASK		0xffff
/** @defgroup ethernet_mac_macl4a0r_l4sp0 L4SP0 L4SP0
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macl3a00r MACL3A00R MACL3A00R
@{*/


#define Ethernet_MAC_MACL3A00R_L3A00_SHIFT		0
#define Ethernet_MAC_MACL3A00R_L3A00_MASK		0xffffffff
/** @defgroup ethernet_mac_macl3a00r_l3a00 L3A00 L3A00
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macl3a10r MACL3A10R Layer3 address 1 filter 0 register
@{*/


#define Ethernet_MAC_MACL3A10R_L3A10_SHIFT		0
#define Ethernet_MAC_MACL3A10R_L3A10_MASK		0xffffffff
/** @defgroup ethernet_mac_macl3a10r_l3a10 L3A10 L3A10
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macl3a20 MACL3A20 Layer3 Address 2 filter 0 register
@{*/


#define Ethernet_MAC_MACL3A20_L3A20_SHIFT		0
#define Ethernet_MAC_MACL3A20_L3A20_MASK		0xffffffff
/** @defgroup ethernet_mac_macl3a20_l3a20 L3A20 L3A20
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macl3a30 MACL3A30 Layer3 Address 3 filter 0 register
@{*/


#define Ethernet_MAC_MACL3A30_L3A30_SHIFT		0
#define Ethernet_MAC_MACL3A30_L3A30_MASK		0xffffffff
/** @defgroup ethernet_mac_macl3a30_l3a30 L3A30 L3A30
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_macl3l4c1r MACL3L4C1R L3 and L4 control 1 register
@{*/

/** Ethernet_MAC_MACL3L4C1R_L4DPIM1 L4DPIM1 **/
#define Ethernet_MAC_MACL3L4C1R_L4DPIM1		(1 << 21)
/** Ethernet_MAC_MACL3L4C1R_L4DPM1 L4DPM1 **/
#define Ethernet_MAC_MACL3L4C1R_L4DPM1		(1 << 20)
/** Ethernet_MAC_MACL3L4C1R_L4SPIM1 L4SPIM1 **/
#define Ethernet_MAC_MACL3L4C1R_L4SPIM1		(1 << 19)
/** Ethernet_MAC_MACL3L4C1R_L4SPM1 L4SPM1 **/
#define Ethernet_MAC_MACL3L4C1R_L4SPM1		(1 << 18)
/** Ethernet_MAC_MACL3L4C1R_L4PEN1 L4PEN1 **/
#define Ethernet_MAC_MACL3L4C1R_L4PEN1		(1 << 16)

#define Ethernet_MAC_MACL3L4C1R_L3HDBM1_SHIFT		11
#define Ethernet_MAC_MACL3L4C1R_L3HDBM1_MASK		0x1f
/** @defgroup ethernet_mac_macl3l4c1r_l3hdbm1 L3HDBM1 L3HDBM1
@{*/
/**@}*/


#define Ethernet_MAC_MACL3L4C1R_L3HSBM1_SHIFT		6
#define Ethernet_MAC_MACL3L4C1R_L3HSBM1_MASK		0x1f
/** @defgroup ethernet_mac_macl3l4c1r_l3hsbm1 L3HSBM1 L3HSBM1
@{*/
/**@}*/

/** Ethernet_MAC_MACL3L4C1R_L3DAIM1 L3DAIM1 **/
#define Ethernet_MAC_MACL3L4C1R_L3DAIM1		(1 << 5)
/** Ethernet_MAC_MACL3L4C1R_L3DAM1 L3DAM1 **/
#define Ethernet_MAC_MACL3L4C1R_L3DAM1		(1 << 4)
/** Ethernet_MAC_MACL3L4C1R_L3SAIM1 L3SAIM1 **/
#define Ethernet_MAC_MACL3L4C1R_L3SAIM1		(1 << 3)
/** Ethernet_MAC_MACL3L4C1R_L3SAM1 L3SAM1 **/
#define Ethernet_MAC_MACL3L4C1R_L3SAM1		(1 << 2)
/** Ethernet_MAC_MACL3L4C1R_L3PEN1 L3PEN1 **/
#define Ethernet_MAC_MACL3L4C1R_L3PEN1		(1 << 0)

/**@}*/

