grevaillot/svd_tools/headers/STM32H7x7_CM7/ethernet_mac.h
/** @defgroup ethernet_mac_mtltxqomr MTLTxQOMR Tx queue operating mode Register
@{*/


#define Ethernet_MAC_MTLTxQOMR_TQS_SHIFT		16
#define Ethernet_MAC_MTLTxQOMR_TQS_MASK		0x1ff
/** @defgroup ethernet_mac_mtltxqomr_tqs TQS Transmit Queue Size
@{*/
/**@}*/


#define Ethernet_MAC_MTLTxQOMR_TTC_SHIFT		4
#define Ethernet_MAC_MTLTxQOMR_TTC_MASK		0x07
/** @defgroup ethernet_mac_mtltxqomr_ttc TTC Transmit Threshold Control
@{*/
/**@}*/


#define Ethernet_MAC_MTLTxQOMR_TXQEN_SHIFT		2
#define Ethernet_MAC_MTLTxQOMR_TXQEN_MASK		0x03
/** @defgroup ethernet_mac_mtltxqomr_txqen TXQEN Transmit Queue Enable
@{*/
/**@}*/

/** Ethernet_MAC_MTLTxQOMR_TSF Transmit Store and Forward **/
#define Ethernet_MAC_MTLTxQOMR_TSF		(1 << 1)
/** Ethernet_MAC_MTLTxQOMR_FTQ Flush Transmit Queue **/
#define Ethernet_MAC_MTLTxQOMR_FTQ		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_mtltxqur MTLTxQUR Tx queue underflow register
@{*/

/** Ethernet_MAC_MTLTxQUR_UFCNTOVF UFCNTOVF **/
#define Ethernet_MAC_MTLTxQUR_UFCNTOVF		(1 << 11)

#define Ethernet_MAC_MTLTxQUR_UFFRMCNT_SHIFT		0
#define Ethernet_MAC_MTLTxQUR_UFFRMCNT_MASK		0x7ff
/** @defgroup ethernet_mac_mtltxqur_uffrmcnt UFFRMCNT Underflow Packet Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mtltxqdr MTLTxQDR Tx queue debug Register
@{*/


#define Ethernet_MAC_MTLTxQDR_STXSTSF_SHIFT		20
#define Ethernet_MAC_MTLTxQDR_STXSTSF_MASK		0x07
/** @defgroup ethernet_mac_mtltxqdr_stxstsf STXSTSF STXSTSF
@{*/
/**@}*/


#define Ethernet_MAC_MTLTxQDR_PTXQ_SHIFT		16
#define Ethernet_MAC_MTLTxQDR_PTXQ_MASK		0x07
/** @defgroup ethernet_mac_mtltxqdr_ptxq PTXQ PTXQ
@{*/
/**@}*/

/** Ethernet_MAC_MTLTxQDR_TXSTSFSTS TXSTSFSTS **/
#define Ethernet_MAC_MTLTxQDR_TXSTSFSTS		(1 << 5)
/** Ethernet_MAC_MTLTxQDR_TXQSTS TXQSTS **/
#define Ethernet_MAC_MTLTxQDR_TXQSTS		(1 << 4)
/** Ethernet_MAC_MTLTxQDR_TWCSTS TWCSTS **/
#define Ethernet_MAC_MTLTxQDR_TWCSTS		(1 << 3)

#define Ethernet_MAC_MTLTxQDR_TRCSTS_SHIFT		1
#define Ethernet_MAC_MTLTxQDR_TRCSTS_MASK		0x03
/** @defgroup ethernet_mac_mtltxqdr_trcsts TRCSTS TRCSTS
@{*/
/**@}*/

/** Ethernet_MAC_MTLTxQDR_TXQPAUSED TXQPAUSED **/
#define Ethernet_MAC_MTLTxQDR_TXQPAUSED		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_mtlqicsr MTLQICSR Queue interrupt control status Register
@{*/

/** Ethernet_MAC_MTLQICSR_RXOIE RXOIE **/
#define Ethernet_MAC_MTLQICSR_RXOIE		(1 << 24)
/** Ethernet_MAC_MTLQICSR_RXOVFIS RXOVFIS **/
#define Ethernet_MAC_MTLQICSR_RXOVFIS		(1 << 16)
/** Ethernet_MAC_MTLQICSR_TXUIE TXUIE **/
#define Ethernet_MAC_MTLQICSR_TXUIE		(1 << 8)
/** Ethernet_MAC_MTLQICSR_TXUNFIS TXUNFIS **/
#define Ethernet_MAC_MTLQICSR_TXUNFIS		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_mtlrxqomr MTLRxQOMR Rx queue operating mode register
@{*/


#define Ethernet_MAC_MTLRxQOMR_RQS_SHIFT		20
#define Ethernet_MAC_MTLRxQOMR_RQS_MASK		0x07
/** @defgroup ethernet_mac_mtlrxqomr_rqs RQS RQS
@{*/
/**@}*/


#define Ethernet_MAC_MTLRxQOMR_RFD_SHIFT		14
#define Ethernet_MAC_MTLRxQOMR_RFD_MASK		0x07
/** @defgroup ethernet_mac_mtlrxqomr_rfd RFD RFD
@{*/
/**@}*/


#define Ethernet_MAC_MTLRxQOMR_RFA_SHIFT		8
#define Ethernet_MAC_MTLRxQOMR_RFA_MASK		0x07
/** @defgroup ethernet_mac_mtlrxqomr_rfa RFA RFA
@{*/
/**@}*/

/** Ethernet_MAC_MTLRxQOMR_EHFC EHFC **/
#define Ethernet_MAC_MTLRxQOMR_EHFC		(1 << 7)
/** Ethernet_MAC_MTLRxQOMR_DIS_TCP_EF DIS_TCP_EF **/
#define Ethernet_MAC_MTLRxQOMR_DIS_TCP_EF		(1 << 6)
/** Ethernet_MAC_MTLRxQOMR_RSF RSF **/
#define Ethernet_MAC_MTLRxQOMR_RSF		(1 << 5)
/** Ethernet_MAC_MTLRxQOMR_FEP FEP **/
#define Ethernet_MAC_MTLRxQOMR_FEP		(1 << 4)
/** Ethernet_MAC_MTLRxQOMR_FUP FUP **/
#define Ethernet_MAC_MTLRxQOMR_FUP		(1 << 3)

#define Ethernet_MAC_MTLRxQOMR_RTC_SHIFT		0
#define Ethernet_MAC_MTLRxQOMR_RTC_MASK		0x03
/** @defgroup ethernet_mac_mtlrxqomr_rtc RTC RTC
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mtlrxqmpocr MTLRxQMPOCR Rx queue missed packet and overflow counter register
@{*/

/** Ethernet_MAC_MTLRxQMPOCR_MISCNTOVF MISCNTOVF **/
#define Ethernet_MAC_MTLRxQMPOCR_MISCNTOVF		(1 << 27)

#define Ethernet_MAC_MTLRxQMPOCR_MISPKTCNT_SHIFT		16
#define Ethernet_MAC_MTLRxQMPOCR_MISPKTCNT_MASK		0x7ff
/** @defgroup ethernet_mac_mtlrxqmpocr_mispktcnt MISPKTCNT MISPKTCNT
@{*/
/**@}*/

/** Ethernet_MAC_MTLRxQMPOCR_OVFCNTOVF OVFCNTOVF **/
#define Ethernet_MAC_MTLRxQMPOCR_OVFCNTOVF		(1 << 11)

#define Ethernet_MAC_MTLRxQMPOCR_OVFPKTCNT_SHIFT		0
#define Ethernet_MAC_MTLRxQMPOCR_OVFPKTCNT_MASK		0x7ff
/** @defgroup ethernet_mac_mtlrxqmpocr_ovfpktcnt OVFPKTCNT OVFPKTCNT
@{*/
/**@}*/


/**@}*/

/** @defgroup ethernet_mac_mtlrxqdr MTLRxQDR Rx queue debug register
@{*/


#define Ethernet_MAC_MTLRxQDR_PRXQ_SHIFT		16
#define Ethernet_MAC_MTLRxQDR_PRXQ_MASK		0x3fff
/** @defgroup ethernet_mac_mtlrxqdr_prxq PRXQ PRXQ
@{*/
/**@}*/


#define Ethernet_MAC_MTLRxQDR_RXQSTS_SHIFT		4
#define Ethernet_MAC_MTLRxQDR_RXQSTS_MASK		0x03
/** @defgroup ethernet_mac_mtlrxqdr_rxqsts RXQSTS RXQSTS
@{*/
/**@}*/


#define Ethernet_MAC_MTLRxQDR_RRCSTS_SHIFT		1
#define Ethernet_MAC_MTLRxQDR_RRCSTS_MASK		0x03
/** @defgroup ethernet_mac_mtlrxqdr_rrcsts RRCSTS RRCSTS
@{*/
/**@}*/

/** Ethernet_MAC_MTLRxQDR_RWCSTS RWCSTS **/
#define Ethernet_MAC_MTLRxQDR_RWCSTS		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_dmamr DMAMR DMA mode register
@{*/

/** Ethernet_MAC_DMAMR_INTM Interrupt Mode **/
#define Ethernet_MAC_DMAMR_INTM		(1 << 16)

#define Ethernet_MAC_DMAMR_PR_SHIFT		12
#define Ethernet_MAC_DMAMR_PR_MASK		0x07
/** @defgroup ethernet_mac_dmamr_pr PR Priority ratio
@{*/
/**@}*/

/** Ethernet_MAC_DMAMR_TXPR Transmit priority **/
#define Ethernet_MAC_DMAMR_TXPR		(1 << 11)
/** Ethernet_MAC_DMAMR_DA DMA Tx or Rx Arbitration Scheme **/
#define Ethernet_MAC_DMAMR_DA		(1 << 1)
/** Ethernet_MAC_DMAMR_SWR Software Reset **/
#define Ethernet_MAC_DMAMR_SWR		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_dmasbmr DMASBMR System bus mode register
@{*/

/** Ethernet_MAC_DMASBMR_RB Rebuild INCRx Burst **/
#define Ethernet_MAC_DMASBMR_RB		(1 << 15)
/** Ethernet_MAC_DMASBMR_MB Mixed Burst **/
#define Ethernet_MAC_DMASBMR_MB		(1 << 14)
/** Ethernet_MAC_DMASBMR_AAL Address-Aligned Beats **/
#define Ethernet_MAC_DMASBMR_AAL		(1 << 12)
/** Ethernet_MAC_DMASBMR_FB Fixed Burst Length **/
#define Ethernet_MAC_DMASBMR_FB		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_dmaisr DMAISR Interrupt status register
@{*/

/** Ethernet_MAC_DMAISR_MACIS MAC Interrupt Status **/
#define Ethernet_MAC_DMAISR_MACIS		(1 << 17)
/** Ethernet_MAC_DMAISR_MTLIS MTL Interrupt Status **/
#define Ethernet_MAC_DMAISR_MTLIS		(1 << 16)
/** Ethernet_MAC_DMAISR_DC0IS DMA Channel Interrupt Status **/
#define Ethernet_MAC_DMAISR_DC0IS		(1 << 0)

/**@}*/

/** @defgroup ethernet_mac_dmadsr DMADSR Debug status register
@{*/


#define Ethernet_MAC_DMADSR_TPS0_SHIFT		12
#define Ethernet_MAC_DMADSR_TPS0_MASK		0x0f
/** @defgroup ethernet_mac_dmadsr_tps0 TPS0 DMA Channel Transmit Process State
@{*/
/**@}*/


